## Himanshu G Marekar       DS-41

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\student\anaconda3\lib\site-packages (1.4.4)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\student\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\student\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\student\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\student\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [6]:
import pandas as pd

### series

In [7]:
s=pd.Series([2,4,5,6,9])
print(s)
print(type(s))

0    2
1    4
2    5
3    6
4    9
dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
date_series=pd.date_range(start='11-09-2017',end='12-12-2017')
date_series

DatetimeIndex(['2017-11-09', '2017-11-10', '2017-11-11', '2017-11-12',
               '2017-11-13', '2017-11-14', '2017-11-15', '2017-11-16',
               '2017-11-17', '2017-11-18', '2017-11-19', '2017-11-20',
               '2017-11-21', '2017-11-22', '2017-11-23', '2017-11-24',
               '2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
               '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
               '2017-12-03', '2017-12-04', '2017-12-05', '2017-12-06',
               '2017-12-07', '2017-12-08', '2017-12-09', '2017-12-10',
               '2017-12-11', '2017-12-12'],
              dtype='datetime64[ns]', freq='D')

### Dataframe

In [14]:
country=["India","Russia","Japan","France","Portugal","s-pain"]
symb=["Ind","ru","jp","fr","cr7","sp"]
dic_world={"country":country,"symb":symb}

In [15]:
print(dic_world)

{'country': ['India', 'Russia', 'Japan', 'France', 'Portugal', 's-pain'], 'symb': ['Ind', 'ru', 'jp', 'fr', 'cr7', 'sp']}

In [16]:
dic_world["country"]

['India', 'Russia', 'Japan', 'France', 'Portugal', 's-pain']

In [17]:
dic_world["symb"]

['Ind', 'ru', 'jp', 'fr', 'cr7', 'sp']

In [18]:
data=pd.DataFrame(dic_world)

In [19]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [20]:
print(data)

    country symb
0     India  Ind
1    Russia   ru
2     Japan   jp
3    France   fr
4  Portugal  cr7
5    s-pain   sp

In [23]:
print(data["symb"])
#print(data.symb)

0    Ind
1     ru
2     jp
3     fr
4    cr7
5     sp
Name: symb, dtype: object

In [33]:
cars_per_cap=[900,456,234,675,62,658,95]
ctr=["India","Russia","Japan","France","Portugal","s-pain","Argentina"]
drives_right=[True,False,True,False,False,True,False]

In [34]:
#create dic
dict={"cars_per_cap" : cars_per_cap,"ctr":ctr,"drives_right":drives_right}

In [35]:
#create dataframe
dic=pd.DataFrame(dict)

In [36]:
print(dic)

   cars_per_cap        ctr  drives_right
0           900      India          True
1           456     Russia         False
2           234      Japan          True
3           675     France         False
4            62   Portugal         False
5           658     s-pain          True
6            95  Argentina         False

In [41]:
print(dic.cars_per_cap.min())
print(dic.cars_per_cap.max())
print(dic.cars_per_cap.std())
print(dic.cars_per_cap.count())

62
900
321.18271020298295
7

### Df using list

In [44]:
ctr=["India","Russia","Japan","France","Portugal","s-pain","Argentina"]
cars_per_cap=[900,456,234,675,62,658,95]
df_list_1=pd.DataFrame(ctr,columns=['ctr name'])

In [45]:
print(df_list_1)

    ctr name
0      India
1     Russia
2      Japan
3     France
4   Portugal
5     s-pain
6  Argentina

In [50]:
df_2=pd.DataFrame(list(zip(ctr,cars_per_cap)),columns=['ctr name','cars_per_cap'])

In [51]:
print(df_2)

    ctr name  cars_per_cap
0      India           900
1     Russia           456
2      Japan           234
3     France           675
4   Portugal            62
5     s-pain           658
6  Argentina            95

In [54]:
lst=[['hgm','marcus',7],['WarGod','AD',69],['Duck_feet','AcA',31]]
df=pd.DataFrame(lst,columns=['FName','Lname','Code'],dtype=int)
print(df)

       FName   Lname  Code
0        hgm  marcus     7
1     WarGod      AD    69
2  Duck_feet     AcA    31

C:\Users\Student\AppData\Local\Temp\ipykernel_9416\165820475.py:2: FutureWarning: Could not cast to int32, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame(lst,columns=['FName','Lname','Code'],dtype=int)

### Working with CSV

In [3]:
sport = pd.read_csv("tennis.csv")

In [4]:
type(sport)

pandas.core.frame.DataFrame

In [6]:
sport

    Day   Outlook  Temp Humidity    Wind PlayTennis
0    D1     Sunny   Hot     High    Weak         No
1    D2     Sunny   Hot     High  Strong         No
2    D3  Overcast   Hot     High    Weak        Yes
3    D4      Rain  Mild     High    Weak        Yes
4    D5      Rain  Cool   Normal    Weak        Yes
5    D6      Rain  Cool   Normal  Strong         No
6    D7  Overcast  Cool   Normal    Weak        Yes
7    D8     Sunny  Mild     High    Weak         No
8    D9     Sunny  Cool   Normal    Weak        Yes
9   D10      Rain  Mild   Normal  Strong        Yes
10  D11     Sunny  Mild   Normal  Strong        Yes
11  D12  Overcast  Mild     High  Strong        Yes
12  D13  Overcast   Hot   Normal    Weak        Yes
13  D14      Rain  Mild     High  Strong         No

In [7]:
sport.head()

  Day   Outlook  Temp Humidity    Wind PlayTennis
0  D1     Sunny   Hot     High    Weak         No
1  D2     Sunny   Hot     High  Strong         No
2  D3  Overcast   Hot     High    Weak        Yes
3  D4      Rain  Mild     High    Weak        Yes
4  D5      Rain  Cool   Normal    Weak        Yes

In [8]:
sport.tail()

    Day   Outlook  Temp Humidity    Wind PlayTennis
9   D10      Rain  Mild   Normal  Strong        Yes
10  D11     Sunny  Mild   Normal  Strong        Yes
11  D12  Overcast  Mild     High  Strong        Yes
12  D13  Overcast   Hot   Normal    Weak        Yes
13  D14      Rain  Mild     High  Strong         No

In [9]:
sport.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Day         14 non-null     object
 1   Outlook     14 non-null     object
 2   Temp        14 non-null     object
 3   Humidity    14 non-null     object
 4   Wind        14 non-null     object
 5   PlayTennis  14 non-null     object
dtypes: object(6)
memory usage: 800.0+ bytes

In [10]:
sport.describe()

       Day Outlook  Temp Humidity  Wind PlayTennis
count   14      14    14       14    14         14
unique  14       3     3        2     2          2
top     D1   Sunny  Mild     High  Weak        Yes
freq     1       5     6        7     8          9

In [12]:
#for description of any section
sport.Temp.describe()

count       14
unique       3
top       Mild
freq         6
Name: Temp, dtype: object

In [13]:
sport.columns

Index(['Day', 'Outlook', 'Temp', 'Humidity', 'Wind', 'PlayTennis'], dtype='object')

In [15]:
sport.dtypes

Day           object
Outlook       object
Temp          object
Humidity      object
Wind          object
PlayTennis    object
dtype: object

In [16]:
sport.shape

(14, 6)

In [19]:
sport.Temp
sport['Temp']
sport[['Temp','Outlook']]
sport[['Temp','Outlook']].head(2)

  Temp Outlook
0  Hot   Sunny
1  Hot   Sunny

In [21]:
sport[['Temp','Wind','Day']][2:6]
sport[['Temp','Wind']][4:7]

   Temp    Wind
4  Cool    Weak
5  Cool  Strong
6  Cool    Weak

### Label and position based indexing : df.loc  and df.iloc

In [27]:
## label-based indexing
#loc = location
sport.loc[5]
sport.loc[:5]
sport.loc[:5,'Temp']
#prnt from temp to wind 
sport.loc[:3,'Temp':'Wind']

   Temp Humidity    Wind
0   Hot     High    Weak
1   Hot     High  Strong
2   Hot     High    Weak
3  Mild     High    Weak

In [30]:
###position-based indexing
#iloc = index location or ilocation
sport.iloc[:3]
#index(3,4)
sport.iloc[3,4]

'Weak'

In [33]:
#loc[row_ind , clm_ind]
sport.iloc[0:5,1:3]

    Outlook  Temp
0     Sunny   Hot
1     Sunny   Hot
2  Overcast   Hot
3      Rain  Mild
4      Rain  Cool

### conditional Query

In [36]:
sport[sport['Outlook']=='Overcast'].count()

Day           4
Outlook       4
Temp          4
Humidity      4
Wind          4
PlayTennis    4
dtype: int64

In [37]:
sport[sport['Outlook']=='Sunny'].count()[3]

5

In [ ]:
sport[(sport['Outlook']=='Overcast') & (sport['Humidity ']=='Normal')].count()[1]

In [ ]:
## assign

In [10]:
W=pd.read_csv("weather_data.csv")

In [50]:
W

      Temperature  DewPoint  Pressure       Date_Time
0            46.2      37.5         1  20100101 00:00
1            44.6      37.1         1  20100101 01:00
2            44.1      36.9         1  20100101 02:00
3            43.8      36.9         1  20100101 03:00
4            43.5      36.8         1  20100101 04:00
...           ...       ...       ...             ...
8754         51.1      38.1         1  20101231 19:00
8755         49.0      37.9         1  20101231 20:00
8756         47.9      37.9         1  20101231 21:00
8757         46.9      37.9         1  20101231 22:00
8758         46.2      37.7         1  20101231 23:00

[8759 rows x 4 columns]

In [51]:
W.head(3)

   Temperature  DewPoint  Pressure       Date_Time
0         46.2      37.5         1  20100101 00:00
1         44.6      37.1         1  20100101 01:00
2         44.1      36.9         1  20100101 02:00

In [52]:
W.tail(3)

      Temperature  DewPoint  Pressure       Date_Time
8756         47.9      37.9         1  20101231 21:00
8757         46.9      37.9         1  20101231 22:00
8758         46.2      37.7         1  20101231 23:00

In [11]:
W.max()

Temperature              95.3
DewPoint                 72.9
Pressure                    1
Date_Time      20101231 23:00
dtype: object

In [12]:
W.min()

Temperature              41.8
DewPoint                 35.3
Pressure                    1
Date_Time      20100101 00:00
dtype: object

In [15]:
W.Temperature.mean()

68.07725767781702

In [16]:
W.Pressure.mean()

1.0